# num = int(input())
# n1 = num // 100
# n2 = (num % 100) //10
# n3 =num % 10
# s=n1+n2+n3
# p =n1*n2*n3
# print('Сумма цифр =',s)
# print('Произведение цифр =',p)
#
#
#
# num = int(input())
# a = num // 1000
# b = num // 100 % 10
# c = num // 10 % 10
# d = num % 10
#
# print('Цифра в позиции тысяч равна', a)
# print('Цифра в позиции сотен равна', b)
# print('Цифра в позиции десятков равна',c)
# print('Цифра в позиции единиц равна', d)

n =12345
a = n % 100000 //10000 # n//10000
b = n % 10000 //1000
c = n % 1000 //100
d = n % 100 //10
e = n % 10

print(a)

